3B/CS343/04-More-Exceptions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-27 Sun 00:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>More Exceptions</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">More Exceptions</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgce3741d">1. Derived Exception Type</a></li>
<li><a href="#org89aca1f">2. Catch Any</a></li>
<li><a href="#org26ce304">3. Exception Parameters</a></li>
<li><a href="#orgc63147b">4. Exception List</a></li>
<li><a href="#orgb1d8d24">5. Destructor</a></li>
<li><a href="#orgb7863ab">6. Multiple Exceptions</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgce3741d" class="outline-2">
<h2 id="orgce3741d"><span class="section-number-2">1.</span> Derived Exception Type</h2>
<div class="outline-text-2" id="text-1">
<p>
A mechanism for inheritance of exception types.
</p>

<p>
Provides ability to handle an exception at different degrees of specificity along the hierarchy.
</p>

<p>
Higher-level code should catch general exception types to reduce tight coupling.
</p>

<p>
If a base and derived exception are present in different <code>catch</code> clauses, linear search requires that
the derived one must be first.
</p>

<p>
Best to catch an exception by reference since it allows casting.
</p>
</div>
</div>
<div id="outline-container-org89aca1f" class="outline-2">
<h2 id="org89aca1f"><span class="section-number-2">2.</span> Catch Any</h2>
<div class="outline-text-2" id="text-2">
<p>
Mechanism to match any exception propagating through a guarding block.
</p>

<p>
For termination, catch any is used as a general cleanup when a non-specific exception occurs.
</p>
</div>
</div>
<div id="outline-container-org26ce304" class="outline-2">
<h2 id="org26ce304"><span class="section-number-2">3.</span> Exception Parameters</h2>
<div class="outline-text-2" id="text-3">
<p>
Allows passing information from the raise to a handler.
</p>

<p>
Inform a handler about details of the exception and to modify the raise site to fix an exceptional
situation.
</p>

<p>
Parameters are defined inside the exception.
</p>
</div>
</div>
<div id="outline-container-orgc63147b" class="outline-2">
<h2 id="orgc63147b"><span class="section-number-2">4.</span> Exception List</h2>
<div class="outline-text-2" id="text-4">
<p>
Part of a routine&rsquo;s prototype specifying which exception types may propagate from the routine to its
caller.
Allows:
</p>
<ul class="org-ul">
<li>static detection of a raised exception not handled locally or by its caller</li>
<li>runtime detection where the exception may be converted into a special <b>failure exception</b> or
the program terminated</li>
</ul>

<p>
Can be checked as exception types or routines.
With exception types, less reuse is possible.
</p>

<p>
Determining an exception list for a routine can become impossible for concurrent exceptions since
they can propagate at any time.
</p>
</div>
</div>
<div id="outline-container-orgb1d8d24" class="outline-2">
<h2 id="orgb1d8d24"><span class="section-number-2">5.</span> Destructor</h2>
<div class="outline-text-2" id="text-5">
<p>
Implictly <code>noexcept</code>, but can raise an exception if explicitly marked <code>noexcept(false)</code>.
</p>
</div>
</div>
<div id="outline-container-orgb7863ab" class="outline-2">
<h2 id="orgb7863ab"><span class="section-number-2">6.</span> Multiple Exceptions</h2>
<div class="outline-text-2" id="text-6">
<p>
An exception handler can generate an arbitrary number of nested exceptions.
</p>

<p>
Only destructor code can intervene during propagation, so a destructor cannot raise an exception during
propagation, it can only start propagation.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-10-27 Sun 00:07</p>
</div>
</body>
</html>
