3B/CS343/04-More-Exceptions.tex
% Created 2024-10-27 Sun 00:07
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{More Exceptions}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={More Exceptions},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Derived Exception Type}
\label{sec:org42deb01}
A mechanism for inheritance of exception types.

Provides ability to handle an exception at different degrees of specificity along the hierarchy.

Higher-level code should catch general exception types to reduce tight coupling.

If a base and derived exception are present in different \texttt{catch} clauses, linear search requires that
the derived one must be first.

Best to catch an exception by reference since it allows casting.
\section{Catch Any}
\label{sec:org1d3428c}
Mechanism to match any exception propagating through a guarding block.

For termination, catch any is used as a general cleanup when a non-specific exception occurs.
\section{Exception Parameters}
\label{sec:orge0b0a94}
Allows passing information from the raise to a handler.

Inform a handler about details of the exception and to modify the raise site to fix an exceptional
situation.

Parameters are defined inside the exception.
\section{Exception List}
\label{sec:org653a6de}
Part of a routine's prototype specifying which exception types may propagate from the routine to its
caller.
Allows:
\begin{itemize}
\item static detection of a raised exception not handled locally or by its caller
\item runtime detection where the exception may be converted into a special \textbf{failure exception} or
the program terminated
\end{itemize}

Can be checked as exception types or routines.
With exception types, less reuse is possible.

Determining an exception list for a routine can become impossible for concurrent exceptions since
they can propagate at any time.
\section{Destructor}
\label{sec:orgd187f80}
Implictly \texttt{noexcept}, but can raise an exception if explicitly marked \texttt{noexcept(false)}.
\section{Multiple Exceptions}
\label{sec:orgb950d10}
An exception handler can generate an arbitrary number of nested exceptions.

Only destructor code can intervene during propagation, so a destructor cannot raise an exception during
propagation, it can only start propagation.
\end{document}
